import React from 'react';
import styled from 'styled-components';
import { Color } from '../assets/constants';

export const AboutPage = () => {
  return (
    <Wrapper>
      <Title>За нас</Title>
      <LargeSpacer />
      <BoldText>Тениски с щампа с най-високо качество</BoldText>
      <Spacer />
      <Text>
        Във Тениски Варна правим тениски, чаши, торбички и възглавници с
        висококачествен печат вече 2 години. Независимо дали търсиш тениска с
        щампа – снимка, някаква мисъл или просто нещо забавно, ние можем да ти
        помогнем да намериш точно това, което ти трябва. Произвеждаме качествени
        щамповани тениски само за минути! Разполагаме с най-новата технология в
        принта, а именно DTF - печат върху текстил, благодарение на който
        продуктите ни са ненадминати на пазара. Доказателство за това са
        доволните ни редовни клиенти.
      </Text>
      <LargeSpacer />
      <BoldText>Имаме богат опит</BoldText>
      <Spacer />
      <Text>
        Тениски Варна разполага с физически обект за щамповани мъжки, дамски и
        детски тениски, както и изработката на чаши с със снимка, възглавници с
        надпис и картинка, фото камъни. За да сме още по-близо до нашите
        клиенти, и най-вече до ТЕБ, където и да се намираш, вече имаме и онлайн
        магазин за тениски с щампи, чаши, възглавници и торбички. Никога не е
        било по-лесно да се сдобиеш с тениска от Тениски Варна.
      </Text>
      <LargeSpacer />
      <BoldText>Тениски с щампа за всеки повод</BoldText>
      <Spacer />
      <Text>
        За какъв повод ти трябва тениска? Всъщност, няма значение! Защото при
        нас разнообразието е толкова голямо, че със сигурност ще намериш това,
        което търсиш! Предлагаме голям асортимент – за теб и твоето ежедневие
        или за подарък. Разгледай, избери, поръчай и съвсем скоро ще е при теб.
        Имаме и нещо за хората с тяхна идея! Пиши ни какво искаш и виж как
        твоята идея се превръща в реалност.
      </Text>
      <LargeSpacer />
      <BoldText>Персонализирана тениска с щампа с твой дизайн</BoldText>
      <Spacer />
      <Text>
        Ние вярваме в света, в който ти имаш тоталната свобода да бъдеш себе си,
        без да те съдят. Да експериментираш. Да изразиш себе си. Да бъдеш смел и
        да приемаш живота като необикновено приключение. Затова правим всичко
        възможно да откриеш най-доброто за теб – без значение откъде си или
        какъв е стилът ти. Ние съществуваме, за да ти вдъхнем увереност да бъдеш
        този, който искаш.
      </Text>
      <LargeSpacer />
    </Wrapper>
  );
};

const LargeSpacer = styled.div`
  margin: 24px;
`;

const Spacer = styled.div`
  margin: 8px;
`;

const BoldText = styled.p`
  font-weight: bold;
`;

const Text = styled.p``;

const Title = styled.h1`
  font-size: 24px;
  font-weight: bold;
`;

const Wrapper = styled.div`
  padding: 16px;
  color: ${Color.DARK_GRAY};
`;
